Linux/Git/git.tex
% Created 2020-11-11 mié 19:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Julian Marcos}
\date{\today}
\title{Git}
\hypersetup{
 pdfauthor={Julian Marcos},
 pdftitle={Git},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Que es Git}
\label{sec:org1c820b9}
Git es un control de versiones un programa que te permite versionar los cambios en un proyecto y te permite obtener un archivo guardado del pasado y puedes crear ramificaciones.
\subsection{Add}
\label{sec:orgce634a5}
Te permite añadir archivos al area de staging.
\subsection{Commit}
\label{sec:org2d566e1}
Te permite crear una version con el contenido del area de staging
\subsection{Remotes}
\label{sec:org097e295}
Te permiten subir el codigo a un repositorio por ejemplo ( codeberg.org ).
O puedes tener el repositorio privado y el mundo no lo puede ver.
\subsection{Ramas}
\label{sec:org2866b1f}
Te permite ramificar tu proyecto
\subsection{Gource}
\label{sec:org7867655}
Es un programa externo que te permite ver una representacion grafica de lo que pasa en un repositorio de git o otro svn
\end{document}
